2DCapillaryRiseTest/case/constant/transportProperties.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              #calc "@!alpha1mu!@/@!alpha1Rho!@";
    rho             @!alpha1Rho!@;
}

air
{
    transportModel  Newtonian;
    nu              #calc "@!alpha1mu!@/@!alpha1Rho!@";
    rho             #calc "@!alpha1Rho!@/1000.0";
}


sigma               @!sigma!@;
surfaceForces
{
    sigma @!sigma!@;
    surfaceTensionForceModel @!STM!@; //fitParaboloid RDF
    accelerationModel gravity;
    deltaFunctionModel alphaCSF;
}

// ************************************************************************* //
