2DCapillaryRiseTest/case/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0 && cp -r 0.org 0 
runApplication blockMesh
runApplication checkMesh
runApplication setFields
rm -rf 0/alpha.water.*
rm -rf 0/U.*
rm -rf constant/g.te*
rm -rf constant/transportProperties.*
rm  -rf system/blockMesh.*
rm -rf system/setFields.*
rm -rf system/controlDict.*
rm -rf 0/U.*
runApplication decomposePar

#application $(getApplication)

#runApplication  $(getApplication) 

# ----------------------------------------------------------------- end-of-file
